{
	"Liberal": {
		"leadership" : "On election night, Canadians entrusted the Liberal Party with a majority government – with seats in every province and territory across the country. On November 4, 2015, I was honoured to be sworn in as Canada’s 23rd Prime Minister, with an equal number of men and women in Cabinet — a first in Canada’s history. Over the course of my leadership, I would come back to the same issues over and over again: growth that works for the middle class, and fair economic opportunity for everyone; and a respect for and promotion of freedom and diversity.",
		"policies" : "We will give middle class Canadians a tax break, by making taxes more fair. When middle class Canadians have more money in their pockets to save, invest, and grow the economy, we all benefit. We will cut the middle income tax bracket to 20.5 percent from 22 percent – a seven percent reduction. To pay for this tax cut, we will ask the wealthiest one percent of Canadians to give a little more. We will introduce a new tax bracket of 33 percent for individuals earning more than $200,000 each year.",
		"history": "Under Pierre Trudeau, the mission of a progressive social policy evolved into the goal of creating a just society.The Liberal Party under Trudeau promoted official bilingualism and passed the Official Languages Act, which gave French and English languages equal status in Canada.",
		"fact": "The Liberal Party of Canada is the oldest federal political party in Canada. The party espouses the principles of liberalism and generally sits at the centre of the Canadian political spectrum. The Liberal Party is traditionally positioned to the left of the Conservative Party of Canada and to the right of the New Democratic Party (NDP)."
	},
	"Conservative": {
		"leadership": "Andrew Scheer has been re-elected in 2006, 2008, and 2011, and since the 2015 election has served as the Official Opposition House Leader. Andrew studied History and Politics at the University of Ottawa and the University of Regina.  He passed the Canadian Accredited Insurance Broker program and began his working career in the insurance industry in Regina. As a father of five, Andrew has been known all his life for being true to his conservative principles in politics and out.",
		"policies": "Our number one priority is the economy – creating jobs and economic growth. Canada has led the G-7 in job creation since 2006 because we’ve made the right choices. We’ve created 1.3 million net new jobs since the depths of the global economic recession, and our plan will create another 1.3 million new, well-paying jobs by 2020.",
		"history": "In the late 1980s and 1990s, federal conservative politics became split by the creation of a new western-based protest party, the populist and social conservative Reform Party of Canada created by Preston Manning, son of Alberta Social Credit Premier Ernest Manning. It advocated deep decentralization of government power, abolition of official bilingualism and multiculturalism, democratization of the Canadian Senate, and suggested a potential return to capital punishment, and advocated significant privatization of public services.",
		"fact":"The Conservative Party of Canada, colloquially known as the Tories, is positioned on the right of the Canadian political spectrum.The party's leader is Andrew Scheer, who serves as Leader of the Official Opposition. The Conservative Party is the successor to multiple right-wing parties which have existed in Canada for over a century."
	},
	"New Democratic": {
		"leadership": "In the 2011 federal election the NDP won a record 103 seats, becoming the Official Opposition for the first time in the party's history. The party had a historic breakthrough in Quebec, where they won 59 out of 75 seats. This meant that a majority of the party's MPs now came from a province where they had only ever had two candidates elected in the party's history (Thomas Mulcair and Phil Edmonston, and not concurrently) and had not been fully organized since 1990.",
		"policies": "We will take action to create tens of thousands of new, sustainable, permanent jobs while reducing Canada's climate change emissions and growing the low-carbon economy. We will renew the Climate Leadership panel and work towards implementing their recommendations. Together, we’ll put Canada on a path to meeting our legislated 2050 greenhouse gas emission reduction target. From investing in reforestation, to building new rapid transit solutions, to a comprehensive clean energy program, we will invest in the long-term success of our economy, while doing our part to fight climate change.",
		"history": "The NDP has never formed the federal government. It formed the Official Opposition for the first time in the 41st Canadian Parliament. Before 2011, the party had been a stable presence in the Canadian parliament, and was the third largest political party from1961 to1993, when the party lost official status. The NDP's peak period of policy influence in those periods was during the minority Liberal governments of Lester B. Pearson (1963–68) and Pierre Trudeau (1972–74). After reattaining official party status in1997, the NDP played a similar role in the Liberal and Conservative minority governments of 2004–2011.",
		"fact": "The NDP was founded in 1961 out of the merger of the Co-operative Commonwealth Federation (CCF) with the Canadian Labour Congress (CLC). The NDP has often been Canada's third largest party in Parliament, at times aligning itself with the Liberal Party of Canada."
	},
	"Green": {
		"leadership": "The Green Party of Canada is a federal political party in Canada that was founded in 1983. Its broad and multi-issue political platform reflects its core values of ecological wisdom, social justice, grassroots democracy and non-violence. It has been led by Elizabeth May since 26 August 2006.The party broke 1% of the popular vote in the 2004 federal election, when it received 4.3% and qualified for federal funding.",
		"policies": "Building a sustainable economy is serious business. Boom and bust cycles in the extractive industries have taken a heavy toll on Canadian families and communities, and it’s long past time for us to invest in reliable, long-term, local jobs. The Canadian Sustainable Generations Fund will make critical investments in trades, apprenticeships, and education, and will ensure that all Canadians have the skills and training to prosper today and contribute to building the Canada of tomorrow. These investments in skills training will complement targeted national infrastructure investments in energy efficiency, renewable energy production, digital upgrades, clean-tech manufacturing, tourism, the creative economy, and emerging technologies.",
		"history": " In the 2008 federal election, the Green Party of Canada was invited to the debates for the first time and achieved a high mark of 6.8% of the popular vote. With just under a million votes, it was the only federally funded party to receive more votes than in 2006, but it still failed to win any seats. In the 2011 federal election the Green Party of Canada decided to focus on increasing seats over increasing votes, and succeeded in sending its first MP to Ottawa, while its share of the popular vote dropped to below 4% for the first time in eleven years.",
		"fact": "The Greens have always had leftist and centrist factions that have been ascendant at different times in the party's history. Many Greens also claim that this traditional left-right political spectrum analysis does not accurately capture the pragmatic ecological orientation of an evolving Green Party."
	}
}
