{
	"Liberal": {
	  "Economy": "We will give middle class Canadians a tax break, by making taxes more fair. When middle class Canadians have more money in their pockets to save, invest, and grow the economy, we all benefit. We will cut the middle income tax bracket to 20.5 percent from 22 percent – a seven percent reduction. To pay for this tax cut, we will ask the wealthiest one percent of Canadians to give a little more. We will introduce a new tax bracket of 33 percent for individuals earning more than $200,000 each year.",
	  "Environment": "We will give middle class Canadians a tax break, by making taxes more fair. When middle class Canadians have more money in their pockets to save, invest, and grow the economy, we all benefit. We will cut the middle income tax bracket to 20.5 percent from 22 percent – a seven percent reduction. To pay for this tax cut, we will ask the wealthiest one percent of Canadians to give a little more. We will introduce a new tax bracket of 33 percent for individuals earning more than $200,000 each year.",
	  "Education": "We will work with First Nations to make sure that every First Nations child receives a quality education. It is vital to Canadians’ shared success that we work together to ensure better economic outcomes for First Nations. This starts with education. To help close the funding gap and improve outcomes for First Nations students, we will invest new funding each year in core funding for kindergarten through grade 12 programs.",
	  "Foreign Affairs": "We will renew Canada’s commitment to peacekeeping operations. Under Stephen Harper, Canada has dramatically scaled back its involvement in peace operations – a decision that could not come at a worse time. As the number of violent conflicts in the world escalates, demand for international peace operations has never been greater. We will recommit to supporting international peace operations with the United Nations, and will make our specialized capabilities available on a case-by-case basis.",
	  "Infrastructure and Transport": "We will invest in public transit to shorten commute times, cut air pollution, strengthen our communities, and grow our economy. Canadian cities have been growing at a rapid rate, but investment in public transit has not kept pace. We will get our communities moving again, by giving our provinces, territories, and municipalities the long-term, predictable federal funding they need to make transit plans a reality.",
	  "Aboriginal Issues": "We will immediately launch a national public inquiry into missing and murdered Indigenous women and girls in Canada. The disappearance and death of nearly 1,200 Indigenous women and girls is an ongoing national tragedy that must come to an end. We will immediately launch a national public inquiry into missing and murdered Indigenous women and girls in Canada, to seek recommendations on concrete actions that governments, law enforcement, and others can take to solve these crimes and prevent future ones.",
	  "Justice": "We will give more support to survivors of domestic violence, sexual assault, and sexual harassment, and ensure that more perpetrators are brought to justice. Working together with experts and advocates, we will develop and implement a comprehensive federal gender violence strategy and action plan, aligned with existing provincial strategies. We will ensure that no one fleeing domestic violence is left without a place to turn. We will increase investments in growing and maintaining Canada’s network of shelters and transition houses.",
	  "Security and Terrorism": "We will maintain current National Defence spending levels, including current planned increases. Under Stephen Harper, investments in the Canadian Armed Forces have been erratic, promised increases in funding have been scaled back, and more than $10 billion of approved funding was left unspent. This mismanagement has left Canada’s Armed Forces underfunded and ill-equipped, and the courageous members of the Forces unsupported after years of dedicated service.",
	  "Social Issues": "We will strengthen our communities by investing in the things that make them good places to live. Investing in our communities is not just about creating good jobs and economic growth. It is also about building communities that we are proud to call home. We will improve quality of life for millions of Canadians by prioritizing investment in affordable housing, seniors’ facilities, early learning and child care, and cultural and recreational infrastructure. We will also work with provinces, territories, and First Nations to create a new National Early Learning and Child Care Framework, to ensure that affordable, high-quality, fully inclusive child care is available to all families who need it."
	},
	"New Democratic": {
		"Economy": "We will take action to create tens of thousands of new, sustainable, permanent jobs while reducing Canada's climate change emissions and growing the low-carbon economy. We will renew the Climate Leadership panel and work towards implementing their recommendations. Together, we’ll put Canada on a path to meeting our legislated 2050 greenhouse gas emission reduction target. From investing in reforestation, to building new rapid transit solutions, to a comprehensive clean energy program, we will invest in the long-term success of our economy, while doing our part to fight climate change.",
		"Environment": "We will implement a comprehensive climate action plan that provides a pathway for people to prosper economically while significantly reducing our carbon pollution. Carbon taxes are meant to encourage people and industry to make choices that have a lower impact on our climate. They aren’t meant to make life harder for families like yours. When the price goes up to match the federal mandate, we will create a new climate action rebate cheque for low and middle income families (80 per cent of families). All new money from carbon tax increases will be used to provide rebate cheques for families and invest in climate change solutions that create jobs, benefit communities and reduce climate pollution.", 
		"Education": "We know the know the best way to build a strong economy for today and tomorrow is to invest in the success of our kids. This includes providing stability in the classroom, ensuring all kids have the time and attention they need to do their absolute best and putting an end to parents fundraising for the essentials, so they can focus on their kid’s success instead. Our commitments include: contributing $30 million per year to our school system to ensure kids have the school supplies they need to succeed and creating an ongoing capital fund for school playgrounds.",
		"Foreign Affairs": "We’ll break down barriers to success preventing immigrants from using their professional experience to find meaningful work. This includes the creation of a Centre for Newcomers to help coordinate and educate skilled newcomers in their fields and reversing the Liberal cuts to funding for Adult Basic Education and English language courses for immigrants. At the same time, we’ll improve support for refugees to ensure they can build happy and successful new lives here while working with the federal government to increase our quota under the Provincial Nominee Program and increase control over the terms of qualification.",
		"Infrastructure and Transport": "We support the Mayors’ Council 10-Year Transportation Vision. We have committed to funding 40 per cent of the capital costs of every phase of the plan, in partnership with all levels of government. This plan will create thousands of jobs and fuel economic growth while growing the region and breaking traffic gridlock. Important projects include building the Broadway Skytrain, rapid transit in Surrey, replacing the Patullo Bridge, improving road networks and adding essential bus service. We will also eliminate tolls on the Port Mann and Golden Ears bridges to ease congestion.",
		"Aboriginal Issues": "Our Aboriginal children are overrepresented in government care. We will will implement the recommendations from Grand Chief Ed John’s report and provide better support to keep Aboriginal children at home. We will ensure Delegated Aboriginal Agencies offer core services at the same level offered to non-Aboriginal children. When Aboriginal children do enter care, we will ensure that that there is a plan to connect them with their culture and communities.",
		"Justice": "We will ensure access to justice is fair, timely and affordable by: Hiring new court sheriffs immediately to bring the number back to a historical norm of 525 so fewer accused criminals walk away free without trial, implementing the Surrey Accord and bringing together all levels of government to create a safer, healthier community and address crime, mental health, addiction and homelessness, providing $500,000 a year in stable, secure funding for Surrey’s Wraparound (WRAP) program to connect teens at risk of joining gangs with outreach workers, teachers and police.",
		"Security and Terrorism": "We will protect temporary foreign workers by bringing in a Temporary Foreign Worker registry to give government the information it needs to protect workers. While the majority of employers are responsible, the few who are not hurt workers, damage Canada’s reputation, and compete unfairly against other honest businesses. We’ll also end the collection of illegal recruitment fees by requiring recruiters and employers to register Temporary Foreign Workers. We’ll break down barriers to success preventing immigrants from using their professional experience to find meaningful work.",
		"Social Issues": "We will take bold action to tackle the opioid crisis and get families and people with addictions the fast support they need. This will include: establishing a province-wide strategy to ensure the widest possible availability of life-saving naloxone kits with people trained to use them, and enabling police efforts to disrupt the supply chain, break up major drug rings and send the perpetrators to trial."
	},
	"Green": {
		"Economy": "Building a sustainable economy is serious business. Boom and bust cycles in the extractive industries have taken a heavy toll on Canadian families and communities, and it’s long past time for us to invest in reliable, long-term, local jobs. The Canadian Sustainable Generations Fund will make critical investments in trades, apprenticeships, and education, and will ensure that all Canadians have the skills and training to prosper today and contribute to building the Canada of tomorrow. These investments in skills training will complement targeted national infrastructure investments in energy efficiency, renewable energy production, digital upgrades, clean-tech manufacturing, tourism, the creative economy, and emerging technologies.",
		"Environment": "The Green Party recognizes the need to freeze and subsequently reduce tuition fees across the country, as well as creating needs-based grants to address the student debt crisis. We can fund an accessible post-secondary education system, help foster research and innovation and assist workers by providing flexible training and education for life-long learning. The Green Party sees education as instrumental in developing creativity and equality as the foundation of safe and healthy communities. Education is not an expense, it's an investment.", 
		"Education": "We know the know the best way to build a strong economy for today and tomorrow is to invest in the success of our kids. This includes providing stability in the classroom, ensuring all kids have the time and attention they need to do their absolute best and putting an end to parents fundraising for the essentials, so they can focus on their kid’s success instead. Our commitments include: contributing $30 million per year to our school system to ensure kids have the school supplies they need to succeed and creating an ongoing capital fund for school playgrounds.",
		"Foreign Affairs": "In the next parliament, Green MPs will press for legislation to require that any and all complaints from Beijing under this treaty, even early diplomatic complaints, must be made public. We must ensure that all the other party leaders understand that Canadians want to fight for our laws and push back against complaints from SOEs from the People's Republic of China. We will vigorously oppose the Trans-Pacific Partnership (TPP) and the Comprehensive Economic Trade Agreement (CETA). Greens will also work with Green MPs in governments around the world to open a full-scale global review of all investor-state agreements with the goal of revising and improving all of them to rebalance rights to democracies and reduce global corporate rule.",
		"Infrastructure and Transport": "We support the Mayors’ Council 10-Year Transportation Vision. We have committed to funding 40 per cent of the capital costs of every phase of the plan, in partnership with all levels of government. This plan will create thousands of jobs and fuel economic growth while growing the region and breaking traffic gridlock. Important projects include building the Broadway Skytrain, rapid transit in Surrey, replacing the Patullo Bridge, improving road networks and adding essential bus service. We will also eliminate tolls on the Port Mann and Golden Ears bridges to ease congestion.",
		"Aboriginal Issues": "Creating opportunity for indigenous communities and their people means ensuring access to quality public services for all First Nations, Métis and Inuit. It requires adequate funding for housing, education, and health care, both on and off reserves. We will work to expand rural health care infrastructure by investing in telehealth and mobile medical units, to ensure indigenous communities have access to critical care. The ongoing crisis of missing and murdered indigenous women must be urgently addressed. We will launch a national inquiry and work to ensure that structural violence against indigenous communities is addressed. We also recognize the critical importance of defending languages and cultures, and will provide new federal funding for culturally appropriate education in traditional languages.",
		"Justice": "Good government is founded on prudent planning and rational, evidence-based decision-making in the public interest. Good government provides long-term stability, security from threats both domestic and abroad, and a vision that stretches well beyond four-year election cycles. The Green Party is the only party committed to ending whipped votes. MPs from the other parties in Parliament routinely face whipped votes – they must vote the party line or face punishments, such as not being allowed to speak in the House or even being thrown out of the party. No Green MP will ever face a whipped vote. They will be free to put their conscience and their constituents first.",
		"Security and Terrorism": "Keeping our communities safe means strengthening Canada’s defence capacity by prioritizing roles and missions for our forces that focus on peacekeeping; defensive missions with our allies; border, northern, and coast guard patrols; search and rescue missions; and patrolling our parks. Recognizing the critical role that our forces play also means respecting and truly taking care of our veterans. Canadian veterans deserve our grateful and ongoing support, including secure and generous pensions. Our veterans should never be forced to fight in the courts to secure their long-term benefits or to ensure that Veterans Affairs disability pension promises are honoured.",
		"Social Issues": "We will phase-in a national Guaranteed Livable Income, to ensure that no person's income falls below what is necessary for health, life and dignity. Through the Council of Canadian Governments we will work with the other levels of government whose inadequate poverty band-aid solutions (such as welfare, disability programs) can be rolled up in order to fund Guaranteed Livable Income. Our Housing Strategy will address the continuum of needs – from social housing for those in poverty or dealing with mental health and addiction problems, to First Nations, Métis, and Inuit housing crises, to the market failures depriving those with even a decent income of access to the affordable housing they need. We can ensure that all housing needs are met – whether seniors, youth, or the stressed middle class."
	},
	"Conservative": {
		"Economy": "Our number one priority is the economy – creating jobs and economic growth. Canada has led the G-7 in job creation since 2006 because we’ve made the right choices. We’ve created 1.3 million net new jobs since the depths of the global economic recession, and our plan will create another 1.3 million new, well-paying jobs by 2020.",
		"Environment": "Canadians are committed to an effective approach to climate change, and so are we. We support an approach that benefits both the environment and the economy. The solution to the climate change challenge must come from innovation, not deprivation – through technology and Canadian ingenuity, not by closing down our vital natural resources industries or imposing job-killing carbon taxes.We will continue to balance what’s best for our climate with the needs of our economy, recognizing the importance of both the environment and our economy to all Canadians. We’ll continue with our plan for careful, well-designed regulations and support for companies and researchers to develop new, cleaner technologies. And our low-tax, balanced budget plan to strengthen and grow Canada’s economy will create the conditions for this type of cutting-edge innovation.", 
		"Education": "Part of ensuring Canadian children get the best possible start in life is helping their parents begin saving for their future education. Our Conservative Government has a solid record of making it easier for families to save and prepare for their children's education, including providing tax relief on scholarships and bursaries, and targeting student grants to low- and middle-income students. One of the ways we've helped families is through Registered Education Savings Plans. These plans allow Canadians to invest money tax-free until it’s time to pay that first tuition bill. Because we realize how important this is, our Conservative Government has contributed significantly to Canadian families’ RESPs, through matching grants.",
		"Foreign Affairs": "Canada is a trading nation and we’ve made historic strides to open new markets for Canadian businesses and their workers. The Trans-Pacific Partnership is the largest free trade deal in history. It provides almost 800 million new customers throughout the Asia-Pacific region for Canadian goods and services. Membership in this agreement is a good deal for Canada, one that will create jobs and opportunities and protect our economy.",
		"Infrastructure and Transport": "We’ll launch the Quebec Maritime Prosperity Initiative to fund maritime and port infrastructure – including improvements to facilities for cruise ships and tall ships, such as the Quai Alexandra terminal in Montreal, the Ross Gaudreault terminal in Quebec City, and the restoration of Champlain – Foulon sector promenade. 9We’ll fund key Asia-Pacific Gateway projects in Western Canada to strengthen our transport system and help Canadian businesses, including our farmers, get their products to market. 9And we’ll support major public transit projects – such as Smart Track in the Greater Toronto Area, Light Rail Transit in Surrey and Ottawa, and Calgary’s Green Line – to fight gridlock, reduce travel times for commuters and businesses, and support new economic development.",
		"Aboriginal Issues": "As Canada’s first peoples, Aboriginal Canadians must share in the successes of our modern-day nation. We have taken steps toward that goal, but it's an ongoing journey. We believe the path forward lies in creating stronger, more self-reliant communities through improvements in economic development, land management strategies, and education. We remain committed to working with willing First Nations partners and provinces to improve First Nations educational outcomes so that students living on reserve are better placed to reach their full potential.",
		"Justice": "Like most Canadians, we hope for the successful rehabilitation of people who have fallen into a life of crime. But our first priority is the safety and security of Canadians and the communities where we live, work, and raise our children. There are some criminals so dangerous that, once imprisoned, they must never again walk the streets among us. Our proposed Bill C-53, the Life Means Life Act, will ensure that offenders who are convicted of the most heinous murders or those who are convicted of high treason will be imprisoned for the rest of their natural lives with no access to parole. This includes murders involving sexual assault, kidnapping, terrorism, the killing of police officers or corrections officers, or any first degree murder of a particularly brutal nature.",
		"Security and Terrorism": "When the global terrorist movement threatens Canada and Canadians not just abroad, but at home, that is when we most need moral clarity and tough leadership. We will continue to address the growing problem of terrorist radicalization and violent extremism among Canadian youth by renewing funding for the Kanishka Project for another five years. We will not cut and run, as our opponents would do. We will not abandon our allies in the broad international coalition against ISIS. We will not pull our troops from the fight against jihadi terrorism.",
		"Social Issues": "Homeownership is a key way to support Canadian families. And we’re helping more Canadians become homeowners by providing new support to buy and invest in their homes. Now one in seven Canadian households owns their own homes – one of the highest rates in the industrialized world. And, under our plan for affordable, responsible homeownership, we'll aim to add more than 700,000 new homeowners by 2020."
	}
}


